# 一个值 字符串，数字，布尔，复数
# 多个值容器 有序的有列表和       元组(不能存和修改)
            # 无序的有字典        集合(关系运算，不是为了取)
# 字符串，数字，布尔,列表,字典,元组,集合,复数


# 什么是数值类型？
# 表示数字类的一个数据：
# 整型 int 代表一个整数 作用  表示 年龄  分数
# 浮点型 float    代表一个小数   表示 身高 体重
# 布尔类型   bool 计算机的真假代表一个数字类的数据   0  和 1   True    False     首字母大写  判断真假
# 复数:complex（了解）
# # z = 4 - 4j  # 表示坐标  实部，虚部  表示一个线性的参数
# 序列类型
# 按照一定顺序排序的数据类型
# 列表: list       多个数据	   	存储数据：可以放任任意的数据类型
# 元组： tuple     多个数据		存储数据：可以放任任意的数据类型  不能修改和添加里面的值  私密的数据
# 字符串 str       一个数据      描述性质：表示名字

# 散列类型
# # 什么是散列类型？  不可以进行索引取值

# # 没有顺序，一盘散沙
# # 集合 set     多个数据
# 	存储数据：可以放任任意的数据类型, 可变类型，无序,

# # 字典 dict     多个数据
# 		存储数据：key里面只能放入不可变类型，最好字符串类型，value里面可以放任任意的数据类型